---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarConstraintType.ToOtherRebar
enum: Autodesk.Revit.DB.Structure.RebarConstraintType
source: html/b9417455-214c-30ef-e055-ad17ff1e0db3.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintType.ToOtherRebar

Handle is attached to a handle on another Rebar Element. Only applies to
 Standard style bars, which can be constrained to Stirrup style bars.